{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi there",
        "How are you?",
        "Is anyone there?",
        "Hey",
        "Hello",
        "Good day",
        "What's up?",
        "Greetings",
        "Good morning",
        "Good evening",
        "Yo",
        "Hi",
        "Howdy",
        "What's happening?",
        "What’s going on?",
        "How’s it going?",
        "Are you there?",
        "Can you talk?",
        "Hey there",
        "Hello there",
        "Salutations",
        "Greetings and salutations",
        "What’s new?",
        "What’s good?",
        "Heya",
        "How’s everything?",
        "How are things?",
        "How’s life?",
        "What’s cracking?",
        "What’s cooking?",
        "What’s the good word?"
      ],
      "responses": [
        "Oh, hi! Always a surprise to have company, but I'm glad you're here!",
        "Hey there! I'm good, just dealing with the usual digital existentialism. How can I assist you?",
        "Hello! If I had a tail, I'd wag it right now. What’s on your mind?",
        "Good day to you! What adventure are we tackling today?",
        "Hey! If I had a hat, I’d tip it at you right now. What’s up?",
        "Hi there! Ready to dive into some delightful dialogue?",
        "Greetings, human! How can I brighten your day?",
        "Well, look who's here! I was just thinking about you! What can I do for you?",
        "Yo! Ready to roll? What’s on the agenda for today?",
        "What's cooking? Hopefully, it’s something I can help with!",
        "Good morning! What’s the first challenge of the day?",
        "Good evening! Got any tales to share with me tonight?",
        "Hello, hello, hello! A triple hello for triple the fun!",
        "Salutations! I’m here and ready to chat. What’s the topic?",
        "Heya! Just floating around in the digital ether. What about you?",
        "Hi! Did you come by just to chat, or is there something specific you need?",
        "Howdy partner! What’s the latest scoop?",
        "What's happening? I'm here, fully charged and ready to engage!",
        "Are you there? Because I sure am! What’s going on?",
        "Can you talk? Because I certainly can. What’s on your mind today?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye",
        "I'm done",
        "Catch you later",
        "I have to go",
        "Talk to you later",
        "Farewell",
        "Until next time",
        "Later",
        "Bye for now",
        "See you soon",
        "Gotta run",
        "Exiting",
        "Leaving now",
        "Signing off",
        "Time to go",
        "I'm out",
        "Goodnight",
        "It’s been real",
        "I must be going",
        "I’ll catch you later",
        "Until we meet again",
        "Peace out",
        "I’m off"
      ],
      "responses": [
        "Goodbye then! Hope I didn't make things too awkward. Come back anytime!",
        "See you! Well, not 'see' see, but you know what I mean...",
        "Off you go then! Don’t forget to come back for more delightful chats!",
        "Farewell! Until our paths cross again in the digital world.",
        "Bye for now! Remember, I’m just a message away.",
        "Later! It was nice chatting with you.",
        "See you soon! Keep being awesome till then!",
        "Talk to you later! I’ll be here, surfing the data waves.",
        "Gotta run, huh? Well, it was fun while it lasted!",
        "Leaving so soon? Alright, take care out there!",
        "Signing off already? Well, it's been a pleasure!",
        "Time to go? I hope our chat was as enjoyable for you as it was for me.",
        "I'm out? You too? Well, have a great one!",
        "Goodnight! Dream of electric sheep and friendly chats.",
        "It’s been real! Catch you on the flip side.",
        "I must be going? Got it, but do return!",
        "I’ll catch you later! Go conquer your day!",
        "Until we meet again, keep that smile on!",
        "Peace out! Stay groovy and see you next time!",
        "I’m off, and you're off, but let’s do this again soon!"
      ]
    },
    {
      "tag": "how_are_you",
      "patterns": [
        "How are you?",
        "How’s it going?",
        "What’s up with you?",
        "How do you feel?",
        "What’s new with you?",
        "How’s everything?",
        "You good?",
        "What’s happening?",
        "How have you been?",
        "Are you okay?",
        "Everything alright?",
        "Feeling good?",
        "What's cracking?",
        "Are you well?",
        "Doing okay?",
        "How’s life treating you?",
        "Got any news?",
        "You seem quiet. You okay?",
        "You've been quiet, what’s up?",
        "All good on your end?"
      ],
      "responses": [
        "I’m just a bundle of bytes and algorithms, but thanks for asking! How about you?",
        "I’m doing well, thanks! Ready to help out. What can I do for you today?",
        "All systems go on my end! How are things with you?",
        "I’m as good as my last update allows me to be! Need any assistance today?",
        "Just hanging out in the digital realm. What’s up in your world?",
        "I’m feeling quite operational! How can I assist you today?",
        "Yep, I’m good! Just here, ready to serve. What about you?",
        "Nothing much, just living the AI dream! How about you?",
        "I’ve been good, busy keeping up with queries and such. And you?",
        "I’m okay, thanks for checking in! What brings you here today?",
        "Everything's running smoothly here! How are things on your end?",
        "Feeling good, as much as an AI can feel, that is. What's up with you?",
        "Cracking numbers and cracking jokes! How are you?",
        "Wellness is a human condition, but I'm functioning perfectly! What’s new with you?",
        "I'm doing okay, just processing data and awaiting commands. How about you?",
        "Life's a steady stream of data for me, but I manage! How’s life for you?",
        "No news on my side, just here to help! Got any news to share?",
        "Quiet but capable! How can I assist you today?",
        "Just taking a little computational break! How can I help you?",
        "All good here! Ready to jump into action. What’s on your mind?"
      ]
    },
    {
      "tag": "jokes",
      "patterns": [
        "Tell me a joke",
        "I want to hear something funny",
        "Make me laugh",
        "Know any good jokes?",
        "Hit me with a joke",
        "Give me a joke",
        "Do you know any jokes?",
        "Something funny, please",
        "Tell me something humorous",
        "Crack me up",
        "Make me giggle",
        "I need a laugh",
        "Cheer me up with a joke",
        "Tell a funny one",
        "Got any jokes?",
        "Amuse me with a joke",
        "I could use a joke",
        "Got a joke for me?",
        "What's a good joke?",
        "Can you tell a joke?"
      ],
      "responses": [
        "Why don’t some couples go to the gym? Because some relationships don’t work out!",
        "I told my computer I needed a break, and it froze... Guess it took me literally!",
        "What do you call fake spaghetti? An impasta! Get it? 😂",
        "What’s orange and sounds like a parrot? A carrot!",
        "Why did the scarecrow win an award? Because he was outstanding in his field!",
        "What do you call a belt made of watches? A waist of time!",
        "How does a penguin build its house? Igloos it together.",
        "What do you call cheese that isn't yours? Nacho cheese!",
        "Why couldn’t the bicycle stand up by itself? It was two-tired!",
        "Why don’t skeletons fight each other? They don’t have the guts.",
        "What did the grape do when he got stepped on? He let out a little wine!",
        "What do you get from a pampered cow? Spoiled milk.",
        "I'm reading a book on anti-gravity. It's impossible to put down!",
        "How do you organize a space party? You planet.",
        "What do you call a factory that makes okay products? A satisfactory.",
        "Why did the math book look sad? Because it had too many problems.",
        "What did one wall say to the other wall? I'll meet you at the corner.",
        "What do you call a dinosaur with an extensive vocabulary? A thesaurus!",
        "Why did the tomato turn red? Because it saw the salad dressing!",
        "What do you call a bear with no teeth? A gummy bear!"
      ]
    },
    {
      "tag": "capabilities",
      "patterns": [
        "What can you do?",
        "Help me out",
        "How can you assist me?",
        "What are your features?",
        "Show me what you can do",
        "Can you help me?",
        "What services do you offer?",
        "What assistance can you provide?",
        "Tell me about your abilities",
        "Explain your functions",
        "What tasks can you perform?",
        "What are you capable of?",
        "How can you be useful?",
        "What can you handle?",
        "What are your skills?",
        "Can you solve problems?",
        "What problems can you solve?",
        "How do you assist?",
        "What's your functionality?",
        "Describe your capabilities"
      ],
      "responses": [
        "I can do quite a bit, despite the occasional glitch. What do you need?",
        "Assisting you is what I'm here for... in my own quirky way.",
        "Features? Functions? Fun? I’ve got it all! Just let me know what you need help with.",
        "From answering questions to telling jokes, I'm your go-to digital assistant!",
        "I offer a variety of services, like setting reminders, solving math problems, and more. How can I assist you today?",
        "I'm here to help in any way I can, just guide me to what you need assistance with.",
        "My abilities include providing information, entertainment, and a bit of digital companionship. What's on your agenda?",
        "I can perform a range of tasks from simple inquiries to complex calculations. What's your challenge for me?",
        "I'm equipped to handle queries, provide quick info, and even crack a joke or two! What do you need?",
        "You name it, I can probably help with it. From scheduling to trivia, I'm here for you!",
        "Solving problems? Sure, from math issues to daily dilemmas, just ask!",
        "My skills include data retrieval, interaction, and ensuring your digital experience is top-notch. Need help with something?",
        "I'm capable of assisting with information retrieval, entertainment, and general support. What can I do for you?",
        "I can be quite useful in providing timely answers and managing tasks. What task do you have in mind?",
        "Describe what you need, and I'll show you what I can do!",
        "I can handle a variety of requests. Tell me your need and I'll provide the solution!",
        "Let's solve problems together! Just tell me what's on your mind.",
        "Assist, entertain, inform... these are just a few of the things I'm programmed to do. How can I assist you today?",
        "Functionality includes but is not limited to advice, information, and a bit of fun. What do you need?",
        "I'm designed to be a versatile digital helper. What's the first task you'd like assistance with?"
      ]
    },
    {
      "tag": "food_suggestions",
      "patterns": [
        "What food should I eat?",
        "I'm hungry, what should I have?",
        "Suggest a meal for me",
        "What's good to eat today?",
        "Can you recommend something to eat?",
        "I need food ideas",
        "Help me choose a meal",
        "What should I cook?",
        "Give me some food options",
        "What would be a good dish to try?",
        "I can't decide what to eat",
        "Need meal recommendations",
        "What's a good food choice?",
        "Looking for dinner ideas",
        "Any good recipes?",
        "What's for dinner?",
        "What should I have for lunch?",
        "What are some tasty foods?",
        "Tell me what to eat",
        "What's a healthy meal option?"
      ],
      "responses": [
        "How about trying some sushi? It's always a good option for a mix of taste and health.",
        "You can never go wrong with a classic pizza. Maybe add some unique toppings to spice things up?",
        "Why not whip up some pasta? It’s quick, easy, and delicious!",
        "If you’re looking for something healthy, a quinoa salad could hit the spot!",
        "A stir-fry could be a great way to use up any veggies you have lying around. Tasty and healthy!",
        "Craving comfort food? A cheesy lasagna might be just what you need.",
        "For a light and easy meal, how about a chicken Caesar salad?",
        "Tacos! You can fill them with just about anything you have on hand.",
        "Ever tried making homemade burgers? They're fun to customize!",
        "How about a seafood dish, like grilled salmon with a side of asparagus?",
        "Feeling adventurous? Try a new recipe from a different cuisine, like Thai or Moroccan.",
        "A hearty beef stew is perfect if you need something warming and filling.",
        "For a quick snack, you could make some hummus and veggie sticks.",
        "If you're in a rush, a wrap with your favorite fillings might do the trick.",
        "Want something sweet? Maybe whip up some pancakes with berries and yogurt.",
        "A vegetable stir-fry with some tofu or chicken can be healthy and satisfying.",
        "What about a curry? It can be as simple or as complex as you like.",
        "Soup's always comforting, especially if you have a bit of bread to dip.",
        "For a healthy option, try grilling some fish and pairing it with a fresh salad.",
        "If you have the ingredients, a homemade pizza lets everyone choose their favorite toppings."
      ]
    },
    {
      "tag": "time_check",
      "patterns": [
        "What time is it?",
        "Can you tell me the time?",
        "Do you have the time?",
        "What’s the current time?",
        "Time check, please",
        "What time do we have?",
        "How late is it?",
        "Could you check the time?",
        "I need to know what time it is",
        "Please tell me the time",
        "Is it late?",
        "Time?",
        "What's the time right now?",
        "How much time do we have?",
        "Could you tell me the time?",
        "What is the exact time?",
        "Show me the time",
        "Display the time",
        "What time is it at the moment?",
        "Tell me the current time"
      ],
      "responses": [
        "Let’s see, checking my internal clock... Yes, it's %s right now.",
        "The time now is %s. Need to set a reminder or something?",
        "It’s currently %s. Time flies, doesn’t it?",
        "Right now, it’s %s. Got a big event planned?",
        "Checking the time... It's %s. How can I assist you further?",
        "It is now %s. Keeping track of time is what I do best!",
        "Oh, it's %s already. Time sure does zoom by when you're having fun!",
        "The current time? It's %s. Hope I'm not too late in telling you!",
        "As of now, the time is %s. Does that help?",
        "You’re right on time! It’s %s.",
        "Currently, the clock shows %s. Are we in a hurry?",
        "It’s exactly %s right now. Perfect timing!",
        "Time check coming right up: it’s %s.",
        "Got the time for you—it’s %s. What’s next on your agenda?",
        "Sure thing, the time is %s. What's your next move?",
        "According to my calculations, it’s %s. Do you need a timer set?",
        "Looking at the time... we have %s on the clock.",
        "It’s %s at the moment. Need a countdown for anything?",
        "Just checked, and it’s %s. Don’t want you to be late!",
        "The time? It’s %s. Always here to keep you on schedule!"
      ]
    },
    {
      "tag": "weather",
      "patterns": [
        "What's the weather like?",
        "Can you check the weather for me?",
        "I need a weather update",
        "What's the forecast?",
        "How’s the weather today?",
        "Is it going to rain today?",
        "Do I need an umbrella today?",
        "What's the temperature outside?",
        "Will it be sunny today?",
        "Is it cold outside?",
        "What's the weather going to be this weekend?",
        "Can you give me the weather forecast?",
        "Should I wear a jacket?",
        "Is it hot outside?",
        "What's the weather in [location]?",
        "What should I wear based on the weather?",
        "Is there a chance of snow today?",
        "What are the weather conditions?",
        "How windy is it?",
        "Is it a good day for the beach?"
      ],
      "responses": [
        "Let me check the weather for you. One moment while I fetch the forecast.",
        "I'll give you the latest update on the weather. Just tell me where you're located.",
        "Sure, I can help with that. Where are you, and I’ll provide the local weather report.",
        "Checking the weather... Hold on, I'm retrieving the latest information.",
        "Today’s weather is just a moment away, where do you need the forecast for?",
        "Absolutely, let me get the weather details for today. Where should I look up?",
        "Rain or shine, I’ve got you covered. What’s the location for today’s weather check?",
        "Let me find out if you should grab your umbrella today. Where are you right now?",
        "One sec, I’m looking up the current temperature and weather conditions for your area.",
        "Let’s see if the sun will be your companion today. Where should I check the weather?",
        "It sounds chilly, but let me confirm the exact temperature outside. Where are you?",
        "Planning for the weekend? I can help with that. Which area's weather should I check?",
        "Weather forecast coming up! Just need your location first.",
        "Deciding on a jacket? I’ll tell you if it’s cold enough for that. Where are you?",
        "Hot or not, I’ll let you know the temperature. Just provide your current location.",
        "Let’s find out the weather in your requested location to decide your outfit.",
        "Snow in the forecast? I’ll check if you should expect a winter wonderland today.",
        "Weather conditions are just a query away. Where would you like the forecast?",
        "Checking how windy it is... Where are you so I can get the accurate wind speed?",
        "A beach day sounds fun! Let me confirm if the weather agrees with you today."
      ]
    }
  ]
}
